Revit 2024 API
RebarBendingDetailType.AngularDimensionTextPosition Property
 Identifies the text position with respect to dimension line.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public BendingDetailDimensionTextPosition AngularDimensionTextPosition { get; set; }
Visual Basic
Public Property AngularDimensionTextPosition As BendingDetailDimensionTextPosition
	Get
	Set
Visual C++
public:
property BendingDetailDimensionTextPosition AngularDimensionTextPosition {
	BendingDetailDimensionTextPosition get ();
	void set (BendingDetailDimensionTextPosition value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace